Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ПодтверждениеОперацийБэкОфиса</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подтверждена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РучнойРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодтверждаемыеОперацииБэкОфиса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДанныеКалендаря.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКалендаря</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПереноса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыОперацийБэкОфиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийБэкОфиса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковАктивовСтраховыхКомпаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводПрочихАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВключениеПрочегоИмуществаВСоставПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачислениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловийСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеОбязательствПоСделкеСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаРегистров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Маржа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДивидендов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеРезервовПИФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеСписаниеРезервов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОперацияНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСделки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеКупона</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеПаев</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПогашениеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоручениеНаДвижениеЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставкаЦенныхБумаг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПроцентовПоКредитномуИнструменту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазмещениеКредитногоИнструмента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеДоходаПайщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РешениеОбИзмененииУставногоКапиталаООО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СведенияОРегистрацииПраваСобственности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводнаяБиржеваяСделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводноеИсполнениеОбязательствПоБиржевымСделкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сделка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаРЕПО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСВалютой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСМО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСНедвижимостью</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СделкаСПФИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеЦеннойБумагиСУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЗадолженностейПоПоручению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеЦеннойБумаги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СторнированиеМНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Распоряжение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Записан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПомеченНаУдаление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ФормыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Безналичная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наличная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыВходящихДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыВходящихДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СчетФактура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Счет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Акт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетБрокера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УПД</Name>
					<Comment>Универсальный передаточный документ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/InformationRegisters/ПодтверждениеОперацийБэкОфиса/Forms/ФормаРучногоПодтвержденияОпераций/Ext/Form/Module.bsl
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ОрганизацияПараметр.Видимость	= РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.Организация.Видимость			= Не Элементы.ОрганизацияПараметр.Видимость;
	
	ЭтаФорма.Организация				= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Период.ДатаОкончания		= НачалоДня(ТекущаяДата()) - 1;
	ЭтаФорма.Период.ДатаНачала			= НачалоДня(ЭтаФорма.Период.ДатаОкончания); //'20171001';
	ЭтаФорма.ВремяПодтвержденияОперации	= '00010101203000';
	ЭтаФорма.РучнойРежим				= Истина;
	
	ДоступныеОснования = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьДоступныеОснования();	
	Элементы.ПодтверждаемыеОперацииОснование.СписокВыбора.ЗагрузитьЗначения(ДоступныеОснования);
	
	Если ЭтаФорма.Параметры.Свойство("ПараметрыЗаполнения") Тогда
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ЭтаФорма.Параметры.ПараметрыЗаполнения);
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ОбновитьСписокПриОткрытии") И ЭтаФорма.Параметры.ОбновитьСписокПриОткрытии Тогда
		ОбновитьСписокОперацийНаСервере();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьДоступностьЭлементовФормы(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтаФорма.РежимОтбора = 1 Тогда
		ПроверяемыеРеквизиты.Добавить("СчетДоверительногоУправления");
	ИначеЕсли ЭтаФорма.РежимОтбора = 2 Тогда
		ПроверяемыеРеквизиты.Добавить("ВидДеятельности"); 
	КонецЕсли;
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(ЭтаФорма.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , "Период", Отказ); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	НастроитьВидимостьДоступностьЭлементовФормы(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВремяПодтвержденияОперацииПриИзменении(Элемент)
	Если ПодтверждаемыеОперации.Количество() > 0 Тогда
		Если Вопрос("Обновить время подтверждения выбранных операций?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаОперации Из ПодтверждаемыеОперации Цикл
		Если СтрокаОперации.Выбрано Тогда
			СтрокаОперации.Период								= НачалоДня(СтрокаОперации.Период) + (ЭтаФорма.ВремяПодтвержденияОперации - '00010101');
			СтрокаОперации.ПодтверждениеРаньшеОтменыИлиВнесения	= (СтрокаОперации.Период <= СтрокаОперации.ВремяВнесения) ИЛИ (СтрокаОперации.Период <= СтрокаОперации.ОтменаПодтверждения);	
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура РучнойРежимПриИзменении(Элемент)
	Если ПодтверждаемыеОперации.Количество() > 0 Тогда
		Если Вопрос("Обновить режим подтверждения выбранных операций?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого СтрокаОперации Из ПодтверждаемыеОперации Цикл
		Если СтрокаОперации.Выбрано Тогда
			СтрокаОперации.РучнойРежим = ЭтаФорма.РучнойРежим;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждаемыеОперацииПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждаемыеОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ПодтверждаемыеОперацииОперация" Тогда
		ОткрытьЗначение(Элементы.ПодтверждаемыеОперации.ТекущиеДанные["Операция"]);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждаемыеОперацииОснованиеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПодтверждаемыеОперации.ТекущиеДанные;
	
	ВыделенныеСтроки = Элементы.ПодтверждаемыеОперации.ВыделенныеСтроки;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		ИзменяемаяСтрока = ПодтверждаемыеОперации.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИзменяемаяСтрока.Основание				= ТекущиеДанные.Основание;
		ИзменяемаяСтрока.ОснованиеОпределено	= ЗначениеЗаполнено(ТекущиеДанные.Основание);	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновитьСписокПодтверждаемыхОпераций(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонеЦЕсли;
	
	Если ПодтверждаемыеОперации.Количество() > 0 И ЭтаФорма.Модифицированность Тогда
		Если Вопрос("При обновлении внесенные в список изменения будут потеряны. Продолжить?", РежимДиалогаВопрос.ОКОтмена) <> КодВозвратаДиалога.ОК Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ПодтверждаемыеОперации.Очистить(); // чтобы на сервер уходил пустой список
	
	ОбновитьСписокОперацийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьОперации(Команда)
	
	// Проверяем данные	
	
	НекорректныеЗаписи = ПодтверждаемыеОперации.НайтиСтроки(Новый Структура("Выбрано, ПодтверждениеРаньшеОтменыИлиВнесения", Истина, Истина));
	Если НекорректныеЗаписи.Количество() > 0 Тогда
		Если Вопрос("Время внесения (или отмены подтверждения) нескольких записей позже времени подтверждения, такие записи будут пропущены." + Символы.ПС + "Продолжить?", РежимДиалогаВопрос.ДаНет) <> КодВозвратаДиалога.Да Тогда
			Для Каждого СтрокаОперации Из НекорректныеЗаписи Цикл
				Если (СтрокаОперации.Период <= СтрокаОперации.ВремяВнесения) Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время внесения позже времени подтверждения: " + Строка(СтрокаОперации.Операция), , "ПодтверждаемыеОперации[" + Формат(ПодтверждаемыеОперации.Индекс(СтрокаОперации), "ЧГ=") + "].ВремяВнесения");	
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Время отмены подтверждения позже времени подтверждения: " + Строка(СтрокаОперации.Операция), , "ПодтверждаемыеОперации[" + Формат(ПодтверждаемыеОперации.Индекс(СтрокаОперации), "ЧГ=") + "].ОтменаПодтверждения");	
				КонецЕсли;
			КонецЦикла;
			
			Возврат;	
		КонецЕсли;
	КонецЕсли;	
	
	ПодтвердитьОперацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьОшибкиОпределенияОснования(Команда)
	УстановитьОтборОшибокОпределенияОснования(ЭтаФорма, Не Элементы.ПодтверждаемыеОперацииОшибкиОпределенияОснования.Пометка);	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	ЗаполнитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	ЗаполнитьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВвестиПериод(Команда)
	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период.ДатаНачала		= ЭтаФорма.Период.ДатаНачала;
	ДиалогВыбораПериода.Период.ДатаОкончания	= ЭтаФорма.Период.ДатаОкончания;
	
	Если ДиалогВыбораПериода.Редактировать() Тогда 
		ЭтаФорма.Период.ДатаНачала		= ДиалогВыбораПериода.Период.ДатаНачала;
		ЭтаФорма.Период.ДатаОкончания	= ДиалогВыбораПериода.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ОбновитьСписокОперацийНаСервере()
	ОшибкиОпределенияОснования = 0;	
	
	ПодтверждаемыеОперации.Очистить();

	// Прочие доходы и расходы, связанные с депозитарием
	ПрочиеДоходыИРасходыДепозитария = Новый Массив;
	ПрочиеДоходыИРасходыДепозитария.Добавить(Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам спецдепозитария", Истина));
	ПрочиеДоходыИРасходыДепозитария.Добавить(Справочники.ПрочиеДоходыИРасходы.НайтиПоНаименованию("Общие расходы по услугам депозитария", Истина));	
	
	// Пробегусь по журналу операций бэк-офиса и только по тем документам, для которых требуется подтверждение
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДанныеКалендаря.Дата КАК ДатаОперации,
		|	ДОБАВИТЬКДАТЕ(МИНИМУМ(ДанныеКалендаряСледующиеДни.Дата), СЕКУНДА, РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), &ВремяПодтвержденияОперации, СЕКУНДА)) КАК ДатаПодтверждения
		|ПОМЕСТИТЬ _ДатыПодтверждения
		|ИЗ
		|	РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаря
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеКалендаря КАК ДанныеКалендаряСледующиеДни
		|		ПО (ДанныеКалендаряСледующиеДни.Календарь = ДанныеКалендаря.Календарь)
		|			И (ДанныеКалендаряСледующиеДни.Дата > ДанныеКалендаря.Дата)
		|			И (ДанныеКалендаряСледующиеДни.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейКалендаря.Предпраздничный)))
		|ГДЕ
		|	ДанныеКалендаря.Календарь = ЗНАЧЕНИЕ(Справочник.Календари.Общероссийский)
		|	И (ДанныеКалендаря.Дата >= &ДатаНачала
		|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеКалендаря.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	МАКСИМУМ(ЛицензииДоговоровДоверительногоУправленияСрезПоследних.Действует) КАК Действует
		|ПОМЕСТИТЬ _ДействиеЛицензии
		|ИЗ
		|	РегистрСведений.ЛицензииДоговоровДоверительногоУправления.СрезПоследних(
		|			&ДатаОкончания,
		|			Организация = &Организация
		|				И &СчетДоверительногоУправления В (СчетДоверительногоУправления, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|				И Лицензия.ВидДеятельности = &ВидДеятельности) КАК ЛицензииДоговоровДоверительногоУправленияСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЛицензииДоговоровДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сделка.Организация КАК Организация,
		|	Сделка.Ссылка КАК Операция,
		|	Сделка.Дата КАК ДатаОперации,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.Сделка) КАК ВидОперации
		|ПОМЕСТИТЬ _Операции
		|ИЗ
		|	Документ.Сделка КАК Сделка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДействиеЛицензии КАК _ДействиеЛицензии
		|		ПО Сделка.СчетДоверительногоУправления = _ДействиеЛицензии.СчетДоверительногоУправления
		|ГДЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.Сделка) В (&ПодтверждаемыеВидыОпераций)
		|	И Сделка.Организация = &Организация
		|	И (Сделка.Дата >= &ДатаНачала
		|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
		|	И (Сделка.Дата <= &ДатаОкончания
		|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И Сделка.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И Сделка.Проведен = ИСТИНА
		|	И &СчетДоверительногоУправления В (Сделка.СчетДоверительногоУправления, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|	И (&ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.ПустаяСсылка)
		|			ИЛИ ЕСТЬNULL(_ДействиеЛицензии.Действует, ЛОЖЬ))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИсполнениеОбязательствПоСделке.Организация,
		|	ИсполнениеОбязательствПоСделке.Ссылка,
		|	ИсполнениеОбязательствПоСделке.Дата,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ИсполнениеОбязательствПоСделке)
		|ИЗ
		|	Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДействиеЛицензии КАК _ДействиеЛицензии
		|		ПО ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления = _ДействиеЛицензии.СчетДоверительногоУправления
		|ГДЕ
		|	ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.ИсполнениеОбязательствПоСделке) В (&ПодтверждаемыеВидыОпераций)
		|	И ИсполнениеОбязательствПоСделке.Организация = &Организация
		|	И (ИсполнениеОбязательствПоСделке.Дата >= &ДатаНачала
		|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
		|	И (ИсполнениеОбязательствПоСделке.Дата <= &ДатаОкончания
		|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И ИсполнениеОбязательствПоСделке.МестоХранения <> ЗНАЧЕНИЕ(Справочник.МестаХранения.ВнебиржевойРынок)
		|	И ИсполнениеОбязательствПоСделке.Проведен = ИСТИНА
		|	И &СчетДоверительногоУправления В (ИсполнениеОбязательствПоСделке.СчетДоверительногоУправления, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|	И (&ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.ПустаяСсылка)
		|			ИЛИ ЕСТЬNULL(_ДействиеЛицензии.Действует, ЛОЖЬ))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЖурналОперацийБэкОфиса.Организация,
		|	ЖурналОперацийБэкОфиса.Документ,
		|	ЖурналОперацийБэкОфиса.Дата,
		|	ЖурналОперацийБэкОфиса.ВидОперации
		|ИЗ
		|	РегистрСведений.ЖурналОперацийБэкОфиса КАК ЖурналОперацийБэкОфиса
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДействиеЛицензии КАК _ДействиеЛицензии
		|		ПО ЖурналОперацийБэкОфиса.СчетДоверительногоУправления = _ДействиеЛицензии.СчетДоверительногоУправления
		|ГДЕ
		|	ЖурналОперацийБэкОфиса.ВидОперации В(&ПодтверждаемыеВидыОпераций)
		|	И ЖурналОперацийБэкОфиса.Организация = &Организация
		|	И (ЖурналОперацийБэкОфиса.Дата >= &ДатаНачала
		|			ИЛИ &ДатаНачала = ДАТАВРЕМЯ(1, 1, 1))
		|	И (ЖурналОперацийБэкОфиса.Дата <= &ДатаОкончания
		|			ИЛИ &ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
		|	И ЖурналОперацийБэкОфиса.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проведен)
		|	И &СчетДоверительногоУправления В (ЖурналОперацийБэкОфиса.СчетДоверительногоУправления, ЗНАЧЕНИЕ(Справочник.СчетаДоверительногоУправления.ПустаяСсылка))
		|	И (&ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.ПустаяСсылка)
		|			ИЛИ ЕСТЬNULL(_ДействиеЛицензии.Действует, ЛОЖЬ))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Операции.Организация КАК Организация,
		|	_Операции.Операция КАК Операция,
		|	_Операции.ДатаОперации КАК ДатаОперации,
		|	_ДатыПодтверждения.ДатаПодтверждения КАК Период,
		|	ИСТИНА КАК Выбрано,
		|	&РучнойРежим КАК РучнойРежим,
		|	_Операции.ВидОперации КАК ВидОперации,
		|	ВнесениеОпераций.Период КАК ВремяВнесения,
		|	ОтменаОпераций.Период КАК ОтменаПодтверждения,
		|	_ДатыПодтверждения.ДатаПодтверждения <= ЕСТЬNULL(ВнесениеОпераций.Период, ДАТАВРЕМЯ(1, 1, 1))
		|		ИЛИ _ДатыПодтверждения.ДатаПодтверждения <= ЕСТЬNULL(ОтменаОпераций.Период, ДАТАВРЕМЯ(1, 1, 1)) КАК ПодтверждениеРаньшеОтменыИлиВнесения
		|ИЗ
		|	_Операции КАК _Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПервых(
		|				,
		|				(Организация, Операция) В
		|					(ВЫБРАТЬ
		|						_Операции.Организация,
		|						_Операции.Операция
		|					ИЗ
		|						_Операции)) КАК ВнесениеОпераций
		|		ПО (ВнесениеОпераций.Организация = _Операции.Организация)
		|			И (ВнесениеОпераций.Операция = _Операции.Операция)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПодтверждениеОперацийБэкОфиса.СрезПоследних(
		|				,
		|				(Организация, Операция) В
		|					(ВЫБРАТЬ
		|						_Операции.Организация,
		|						_Операции.Операция
		|					ИЗ
		|						_Операции)) КАК ОтменаОпераций
		|		ПО (ОтменаОпераций.Организация = _Операции.Организация)
		|			И (ОтменаОпераций.Операция = _Операции.Операция)
		|			И (ОтменаОпераций.Период <> ВнесениеОпераций.Период)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ДатыПодтверждения КАК _ДатыПодтверждения
		|		ПО (_ДатыПодтверждения.ДатаОперации = НАЧАЛОПЕРИОДА(_Операции.ДатаОперации, ДЕНЬ))
		|ГДЕ
		|	(ВнесениеОпераций.Операция ЕСТЬ NULL
		|			ИЛИ ОтменаОпераций.Операция ЕСТЬ NULL
		|				И ВнесениеОпераций.Подтверждена = ЛОЖЬ
		|			ИЛИ ОтменаОпераций.Операция ЕСТЬ НЕ NULL 
		|				И ОтменаОпераций.Подтверждена = ЛОЖЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОперации");
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ?(ЭтаФорма.РежимОтбора = 1, ЭтаФорма.СчетДоверительногоУправления, Справочники.СчетаДоверительногоУправления.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ВидДеятельности", ?(ЭтаФорма.РежимОтбора = 2, ЭтаФорма.ВидДеятельности, Справочники.ВидыДеятельности.ПустаяСсылка()));
	Запрос.УстановитьПараметр("ДатаНачала", ЭтаФорма.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ЭтаФорма.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ВремяПодтвержденияОперации", ЭтаФорма.ВремяПодтвержденияОперации);
	Запрос.УстановитьПараметр("РучнойРежим", ЭтаФорма.РучнойРежим);
	
	// Подтверждаемые виды операций
	ПодтверждаемыеВидыОпераций = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.ПолучитьПодтверждаемыеВидыОпераций();
	Запрос.УстановитьПараметр("ПодтверждаемыеВидыОпераций", ПодтверждаемыеВидыОпераций);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ПодтверждаемыеОперации.Загрузить(РезультатЗапроса.Выгрузить());
		
		Для Каждого СтрокаОперации Из ПодтверждаемыеОперации Цикл
			// Алгоритм определения основания
			ВидОперации	= XMLСтрока(СтрокаОперации.ВидОперации);
			
			Если ВидОперации = "ВводКредитногоИнструмента" ИЛИ ВидОперации = "ВыводКредитногоИнструмента" Тогда
				СтрокаОперации.Основание = "Договор";
				
			ИначеЕсли ВидОперации = "НачислениеДивидендов" Тогда
				СтрокаОперации.Основание = "Решение эмитента";
				
			ИначеЕсли ВидОперации = "ПогашениеКупона" ИЛИ ВидОперации = "ПогашениеЦеннойБумаги" Тогда
				СтрокаОперации.Основание = "Проспект эмиссии";
				
			ИначеЕсли ВидОперации = "ПоручениеНаДвижениеДенежныхСредств" ИЛИ ВидОперации = "ПоручениеНаДвижениеЦенныхБумаг" Тогда
				СтрокаОперации.Основание = "Оригинал документа";
				
			ИначеЕсли ВидОперации = "ВводДенежныхСредств" Тогда
				Источник = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаОперации.Операция, "ФормаДенежныхСредств"); 
				
				Если Источник.ФормаДенежныхСредств = Перечисления.ФормыДенежныхСредств.Безналичная Тогда
					СтрокаОперации.Основание = "Банковские выписки";
				Иначе
					СтрокаОперации.Основание = "Приходный кассовый ордер";
				КонецЕсли;
				
			ИначеЕсли ВидОперации = "ВыводДенежныхСредств" ИЛИ ВидОперации = "ЗакрытиеКредитногоИнструмента" 
			ИЛИ ВидОперации = "ПриходПроцентовМНО" ИЛИ ВидОперации = "ПриходПроцентовПоКредитномуИнструменту" ИЛИ ВидОперации = "РазмещениеКредитногоИнструмента" Тогда
				СтрокаОперации.Основание = "Банковские выписки";
				
			ИначеЕсли ВидОперации = "ПереводДенежныхСредств" Тогда
				Источник = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаОперации.Операция, "Брокер, БрокерПолучатель"); 
				
				Если ЗначениеЗаполнено(Источник.Брокер) ИЛИ ЗначениеЗаполнено(Источник.БрокерПолучатель) Тогда
					СтрокаОперации.Основание = "Отчет брокера";	
				Иначе
					СтрокаОперации.Основание = "Банковские выписки";
				КонецЕсли;
				
			ИначеЕсли ВидОперации = "МНО" Тогда
				Источник = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаОперации.Операция, "Основание"); 
				
				Если ЗначениеЗаполнено(Источник.Основание) Тогда
					СтрокаОперации.Основание = "Подтверждение МНО";
				КонецЕсли;
				
			ИначеЕсли (ВидОперации = "Сделка" ИЛИ ВидОперации = "СделкаРЕПО" ИЛИ ВидОперации = "СделкаСВалютой" ИЛИ ВидОперации = "СделкаСМО"
			ИЛИ ВидОперации = "ИзменениеУсловийСделки" ИЛИ ВидОперации = "ИсполнениеОбязательствПоСделке" ИЛИ ВидОперации = "ОтменаСделки") Тогда				
				Если РаботаСДокументами.СделкаЧерезБрокера(СтрокаОперации.Операция) Тогда
					СтрокаОперации.Основание = "Отчет брокера";	
				Иначе				
					СтрокаОперации.Основание = "Договор";
				КонецЕсли;
				
			ИначеЕсли ВидОперации = "Оплата" Тогда
				Источник = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаОперации.Операция, "Брокер"); 
				
				Если ЗначениеЗаполнено(Источник.Брокер) Тогда
					СтрокаОперации.Основание = "Отчет брокера";	
				Иначе
					СтрокаОперации.Основание = "Банковские выписки";
				КонецЕсли;
				
			ИначеЕсли ВидОперации = "НачислениеЗадолженности" Тогда
				Источник = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаОперации.Операция, "Брокер, ВидЗадолженности, ПрочиеДоходыИРасходы, ВидВходящегоДокумента"); 
				
				Если ЗначениеЗаполнено(Источник.Брокер) Тогда
					СтрокаОперации.Основание = "Отчет брокера";	
				Иначе
					Если Источник.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.БанковскаяКомиссия)
					ИЛИ Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоБанковскойКомиссии Тогда
						СтрокаОперации.Основание = "Банковские выписки";
					ИначеЕсли Источник.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.УслугиДоверительногоУправления) Тогда
						СтрокаОперации.Основание = "Расчет вознаграждения";
					ИначеЕсли Источник.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.НДФЛ) Тогда
						СтрокаОперации.Основание = "Расчет НДФЛ";
					ИначеЕсли Источник.ВидЗадолженности.ПринадлежитЭлементу(Справочники.ВидыЗадолженности.ДепозитарнаяКомиссия)
					ИЛИ Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоДепозитарнойКомиссии
					ИЛИ ПрочиеДоходыИРасходыДепозитария.Найти(Источник.ПрочиеДоходыИРасходы) <> Неопределено Тогда
						СтрокаОперации.Основание = "Выставленный счет";
					ИначеЕсли ЗначениеЗаполнено(Источник.ВидВходящегоДокумента) И Источник.ВидВходящегоДокумента <> Перечисления.ВидыВходящихДокументов.ОтчетБрокера Тогда
						СтрокаОперации.Основание = "Оригинал документа";
					КонецЕсли;
				КонецЕсли;
				
				Если Источник.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоПрочимУслугам Тогда
					СтрокаОперации.ДополнительныеСведения = Источник.ПрочиеДоходыИРасходы;		
				КонецЕсли;
				
			ИначеЕсли ВидОперации = "ВводЦенныхБумаг" ИЛИ ВидОперации = "ВыводЦенныхБумаг" ИЛИ ВидОперации = "КонвертацияЦенныхБумаг" ИЛИ ВидОперации = "ПереводЦенныхБумаг" 
			ИЛИ ВидОперации = "ПоставкаЦенныхБумаг" ИЛИ ВидОперации = "СнятиеЦеннойБумагиСУчета" ИЛИ ВидОперации = "СписаниеЦеннойБумаги" Тогда
				СтрокаОперации.Основание = "Отчет депозитария";	
				
			ИначеЕсли ВидОперации = "Маржа" Тогда
				СтрокаОперации.Основание = "Отчет брокера";
				
			КонецЕсли;
			
			СтрокаОперации.ОснованиеОпределено = ЗначениеЗаполнено(СтрокаОперации.Основание);
			Если Не СтрокаОперации.ОснованиеОпределено Тогда
				ОшибкиОпределенияОснования = ОшибкиОпределенияОснования + 1;		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ПодтверждаемыеОперацииОшибкиОпределенияОснования.Заголовок = "Ошибки определения основания" + ?(ОшибкиОпределенияОснования > 0, " (" + Формат(ОшибкиОпределенияОснования, "ЧГ=") + ")", "");
	УстановитьОтборОшибокОпределенияОснования(ЭтаФорма, Ложь);
	
	ЭтаФорма.Модифицированность = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьОперацииНаСервере()
	
	ПодтверждениеОпераций = ПодтверждаемыеОперации.Выгрузить(Новый Структура("Выбрано, ОснованиеОпределено, ПодтверждениеРаньшеОтменыИлиВнесения", Истина, Истина, Ложь));
	
	Если ПодтверждениеОпераций.Количество() > 0 Тогда
		//рсПодтверждениеОперацийБэкОфиса = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьНаборЗаписей();
		//рсПодтверждениеОперацийБэкОфиса.Отбор.Организация.Установить(ПодтверждениеОпераций[0].Организация);	
		//рсПодтверждениеОперацийБэкОфиса.Загрузить(ПодтверждениеОпераций);
		//рсПодтверждениеОперацийБэкОфиса.Записать(Ложь);	
		
		// Делаем так, т.к. через набор велик шанс попасть в блокировку
		Для Каждого ОписаниеПодтверждения Из ПодтверждениеОпераций Цикл
			рсПодтверждениеОперацийБэкОфиса = РегистрыСведений.ПодтверждениеОперацийБэкОфиса.СоздатьМенеджерЗаписи();
			
			ЗаполнитьЗначенияСвойств(рсПодтверждениеОперацийБэкОфиса, ОписаниеПодтверждения);
			рсПодтверждениеОперацийБэкОфиса.Подтверждена = Истина;
			
			Попытка
				рсПодтверждениеОперацийБэкОфиса.Записать(Ложь);
			Исключение
				Сообщить("Ошибка подтверждения операции '" + Строка(ОписаниеПодтверждения.Операция) + "':" + Символы.ПС + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЦикла;
		
		ОбновитьСписокОперацийНаСервере();
	Иначе
		Сообщить("Нет отмеченных операций с заполненным основанием!");
	КонецЕсли;

КонецПроцедуры

#Область Вспомогательные_функции

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступностьЭлементовФормы(ЭтаФорма)

	Элементы = ЭтаФорма.Элементы;		
	
	Элементы.СчетДоверительногоУправления.Видимость	= (ЭтаФорма.РежимОтбора = 1);
	Элементы.ВидДеятельности.Видимость				= (ЭтаФорма.РежимОтбора = 2);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборОшибокОпределенияОснования(ЭтаФорма, Включено)
	ЭтаФорма.Элементы.ПодтверждаемыеОперацииОшибкиОпределенияОснования.Пометка = Включено;	
	
	Если Включено Тогда
		ЭтаФорма.Элементы.ПодтверждаемыеОперации.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("ОснованиеОпределено", Ложь));		
	Иначе
		ЭтаФорма.Элементы.ПодтверждаемыеОперации.ОтборСтрок = Неопределено;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФлажки(Значение)
	Для Каждого СтрокаОперации Из ПодтверждаемыеОперации Цикл
		Если Элементы.ПодтверждаемыеОперации.ПроверитьСтроку(СтрокаОперации.ПолучитьИдентификатор()) Тогда 
			СтрокаОперации.Выбрано = Значение;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждаемыеОперацииДатаПодтвержденияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ПодтверждаемыеОперации.ТекущиеДанные;
	
	ВыделенныеСтроки = Элементы.ПодтверждаемыеОперации.ВыделенныеСтроки;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		ИзменяемаяСтрока = ПодтверждаемыеОперации.НайтиПоИдентификатору(ИдентификаторСтроки);
		ИзменяемаяСтрока.Период									= ТекущиеДанные.Период;
		ИзменяемаяСтрока.ПодтверждениеРаньшеОтменыИлиВнесения	= (ИзменяемаяСтрока.Период <= ИзменяемаяСтрока.ВремяВнесения) ИЛИ (ИзменяемаяСтрока.Период <= ИзменяемаяСтрока.ОтменаПодтверждения);	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти
